# normalization_dict.py
NORMALIZATION_DICT = {
    # Commands
    "إبداء": "ابدأ",
    "ابدأو": "ابدأ",
    "إبدأ": "ابدأ",

    "لاعادة": "لإعادة",
    "اعاده": "لإعادة",

    "قابل":"قابلة",
    "تدوير":"التدوير",

    # Analysis
    "تحيل": "التحليل",
    "تحليل": "التحليل",
    "تحليل": "التحليل",
    "تحليلي": "التحليل",
    "التحيل": "التحليل",

    # Capture / Camera
    "تصوير": "التصوير",
    "تصواير": "التصوير",
    "التصويرة": "التصوير",

    # Materials
    "مواد": "المواد",
    "المودة": "المواد",

    # Damage
    "أضرار": "الأضرار",
    "اضرار": "الأضرار",
    "الضرر": "الأضرار",
    "للإضرار":"الأضرار",

    # Stop / Exit
    "توقف": "توقف",
    "وقف": "توقف",
    "ايقاف": "توقف",

    # Filler words / mishears
    "من حيث": "",
    "بالنسبة": "",
    "على": "",
    "في": "",

    # Map
    "ارسم": "ارسم",
    "خريطه": "خريطة",
    "الخريطه": "الخريطة",

}
